[
    {
        "id": 15,
        "type": "ISSUE",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2024/04/30",
        "datetime_end": "2024/05/31",
        "zh_TW": {
            "title": "關於雲端備份無法使用",
            "content": "由於Google Api調整使用者權限同意請求，如果有發生「原本可以備份，但是近期無法備份、且無法顯示上次備份時間」的情況，可以採取以下做法重新取得Google權限：「點選匯出CSV至雲端(UTF-8)」會跳出新的Google Api同意視窗。並在取得同意後，請將「自動備份功能關閉，再重新開啟」即可。"
        },
        "en_US": {
            "title": "About automatic cloud backup not working",
            "content": "Due to the adjustment of Google API user permission requests, if there is a situation where \"you could back up before, but recently you cannot back up and cannot display the last backup time\", you can take the following steps to re-obtain Google permissions: \"Click on Export CSV to Cloud (UTF-8)\" will pop up a new Google API consent window. After obtaining consent, please \"turn off the automatic backup function, and then turn it back on\"."
        }
    },
    {
        "id": 14,
        "type": "ISSUE",
        "level": "MODERATE",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2023/06/03",
        "datetime_end": "2023/06/30",
        "zh_TW": {
            "title": "關於近期電子發票下載失敗率高的狀況",
            "content": "近期我們注意到發票同步失敗率上升的情況，由於發票資料是由財政部提供，我們僅協助與財政部的資料串接來簡化記帳步驟。而財政部於去年底開始會採取API限流的方式，儘管市面上有一些發票App可以順利下載發票，但財政部表示他們限制了API在特定時間內的流量，一旦達到上限，其他的Request就會被拒絕。作為第三方服務，我們無法控制資料來源端（例如：限流、斷線、停止服務等）的狀況。Hoya記帳先前已經實施了排程機制，從後端24小時嘗試下載發票及明細。然而在發票開獎期間（例如每月底至次月上旬），財政部系統負荷較高，導致發票下載失敗率增加。發票功能只是Hoya記帳服務的其中一項功能，但它依賴於外部資料來源。當然我們仍在持續優化發票下載的機制，但對於第三方服務來說，在這方面的優化受限。如果您非常需要穩定的發票同步來進行記帳，我們建議您考慮使用其他的發票工具，以滿足您對發票使用的需求。"
        },
        "en_US": {
            "title": "Regarding the recent high failure rate of e-invoice downloads",
            "content": "We have recently noticed an increase in the failure rate of invoice synchronization. As the invoice data is provided by the Ministry of Finance, our role is assisting in integrating the data to simplify the recording. However, since the end of last year, the Ministry of Finance has implemented API rate limiting. Although there are some invoice apps can successfully download invoices, the Ministry of Finance has stated that they restrict the flow of API requests within specific time periods, and once the limit is reached, other requests will be rejected. As a third-party service, we cannot control the conditions of the data source (such as rate limiting, disconnection, or service interruption).    Previously, Hoya Money had set up the scheduling job to attempt invoice and invoice detail downloads from the backend server in 24 hours. However, during the invoice lottery period (such as the end of each month to the beginning of the following month), the Ministry of Finance's system experiences higher load, resulting in an increased failure rate of invoice downloads.    The E-Invoice functionality is just one of the features of Hoya Money App, but it relies on external data sources. While we continue to optimize the invoice download mechanism, there are limitations for third-party services in this regard. If you require stable invoice synchronization for your recording needs, we suggest considering alternative invoice tools to meet your requirements."
        }
    },
    {
        "id": 13,
        "type": "ISSUE",
        "level": "MODERATE",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/12/25",
        "datetime_end": "2023/01/06",
        "zh_TW": {
            "title": "[更新] 先前電子發票服務連線無法運作之問題",
            "content": "先前因財政部電子發票API服務針對該流量進行限制的問題，目前新版本App已經依建議，將流量從原本的使用者手機改為集中至Hoya記帳伺服器批次發送，並降低存取頻率。目前正在觀察中，初步評估有比先前穩定，若偶爾連線失敗的情況，可能是存取流量上升導致服務不穩，可隔一段時間後多次嘗試即可。"
        },
        "en_US": {
            "title": "[UPDATE] The e-invoice service connection cannot work in the past",
            "content": "Due to the problem of network traffic limit on the e-invoice API of the Ministry of Finance, the new version of the App has changed the traffic from the original user's phone to the Hoya Money server for batch accessing, and reduced the access frequency. It is currently under observation, and the preliminary assessment is that it is more stable than before. If the connection fails occasionally, it may be that the service is unstable due to the increase in access traffic by user. You can try again."
        }
    },
    {
        "id": 12,
        "type": "ISSUE",
        "level": "HIGH",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/12/01",
        "datetime_end": "2022/12/25",
        "zh_TW": {
            "title": "[處理中] 電子發票服務連線無法運作問題",
            "content": "目前載具發票同步有高機率失敗，因為近期使用財政部電子發票API服務之App愈來愈多，因此有針對該API進行流量限制，而Hoya記帳目前的連線是由使用者手機直接發送，導致流量限制，只有部分使用者能下載到發票。本App後續將進行架構調整以優化此問題，請使用者暫時以手動記帳為主，造成不便敬請見諒。"
        },
        "en_US": {
            "title": "[Processing] The e-invoice service connection cannot work",
            "content": "At present, there is a high probability of device invoice sync. failing, because more and more apps use the Ministry of Finance's e-invoice API service recently, so there is a network traffic limit for this API, and the current connection of Hoya Money is directly sent by the user's phone. As a result of traffic restrictions, only some users can download invoices. The app will be adjusted in the future to optimize this problem. Please recordind manually for the time being, sorry for the inconvenience"
        }
    },
    {
        "id": 11,
        "type": "ISSUE",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/11/27",
        "datetime_end": "2022/11/30",
        "zh_TW": {
            "title": "已知電子發票連線緩慢問題",
            "content": "已知近日同步電子發票、驗證手機條碼時，會發生讀取緩慢或是連線失敗等問題，目前判斷是近日發票開獎導致連線至財政部電子發票API的流量問題。若遇到連線失敗的情況，可隔一段時間後多次嘗試即可。"
        },
        "en_US": {
            "title": "Known issues with slow connections to e-invoices",
            "content": "It is known that when synchronizing e-invoices and verifying mobile barcodes recently, problems such as connection failures will occur. At present, it is judged that the recent invoice lottery results in network traffic problems connecting to the Ministry of Finance's electronic invoice API. If you encounter a connection failure, you can try several times after a period of time."
        }
    },
    {
        "id": 10,
        "type": "NEW",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/09/22",
        "datetime_end": "2022/09/25",
        "zh_TW": {
            "title": "[新功能] 發票條碼及桌面小工具",
            "content": "現已發布的1.4.0版新增發票條碼查看功能及基本桌面小工具（帳戶餘額、專案預算、發票條碼）。"
        },
        "en_US": {
            "title": "[NEW] The mobile barcode and home widgets",
            "content": "Added invoice barcode viewing function and basic home widgets (account balance, project budget, invoice barcode) in the released version 1.4.0."
        }
    },
    {
        "id": 9,
        "type": "FIXED",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/09/22",
        "datetime_end": "2022/09/25",
        "zh_TW": {
            "title": "[已修復] 發票無法同步及自動備份無法運作的問題",
            "content": "先前版本已知部分情況發票不會同步（在電子發票API正常的情況下）的問題；以及自動同步可能無法運作的問題，已發布更新檔進行解決。"
        },
        "en_US": {
            "title": "[FIXED] The invoice will not be auto-synchronized and data will not be auto-backed up",
            "content": "Some invoices will not be auto-synchronized (in the normal case of the electronic invoice API); And problems that data may not be auto-backed up to the Google cloud in the previous version has been fixed with an update."
        }
    },
    {
        "id": 8,
        "type": "FIXED",
        "level": "MODERATE",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/09/10",
        "datetime_end": "2022/09/17",
        "zh_TW": {
            "title": "[已修復] 已知Android 13檔案存取權限問題",
            "content": "先前版本之Android 13無法進行匯入及匯出CSV的問題，已發布更新檔，採用新版檔案讀寫機制進行修正。"
        },
        "en_US": {
            "title": "[FIXED] Known Android 13 file access permission issues",
            "content": "The issue about Android 13 cannot import and export CSV in the previous version has been fixed with an update by using new document reading/writing mechanism."
        }
    },
    {
        "id": 7,
        "type": "BUG",
        "level": "MODERATE",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/09/05",
        "datetime_end": "2022/09/17",
        "zh_TW": {
            "title": "已知Android 13檔案存取權限問題",
            "content": "目前已知Android 13無法進行匯入及匯出CSV的問題，此為Android 13針對應用程式之檔案管控權限細緻化所導致，此問題將待後續更新修復，若後續有其他消息將依新公告進行通知。"
        },
        "en_US": {
            "title": "Known Android 13 file access permission issues",
            "content": "It is known that Android 13 cannot import and export CSV. This is caused by Android 13's detailed file control permissions for applications, If there is other news in this problem, it will be notified according to the new announcement."
        }
    },
    {
        "id": 6,
        "type": "FIXED",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/08/09",
        "datetime_end": "2022/08/11",
        "zh_TW": {
            "title": "[已修復] 電子發票無法刪除問題",
            "content": "先前版本之電子發票無法刪除的問題，已發布更新檔進行修正。"
        },
        "en_US": {
            "title": "[FIXED] The issue about E-Invoice cannot be deleted",
            "content": "The issue about E-Invoice cannot be deleted in the previous version has been fixed with an update."
        }
    },
    {
        "id": 5,
        "type": "BUG",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/08/09",
        "datetime_end": "2022/08/11",
        "zh_TW": {
            "title": "電子發票無法刪除問題",
            "content": "已知存在電子發票無法刪除的問題，屬於程式錯誤，將待更新後修復。"
        },
        "en_US": {
            "title": "The issue about E-Invoice cannot be deleted",
            "content": "It is known that there is an issue that the E-Invoice cannot be deleted, which is a bug and will be fixed after the update."
        }
    },
    {
        "id": 4,
        "type": "FIXED",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/07/27",
        "datetime_end": "2022/07/28",
        "zh_TW": {
            "title": "[已修復] 多類別交易之子紀錄金額顯示有誤",
            "content": "先前版本之多類別交易之子紀錄金額顯示有誤之情況，已發布更新檔進行修正。"
        },
        "en_US": {
            "title": "[FIXED] The sub-record amount of the multi-type transaction is displayed incorrectly",
            "content": "The previous version of the multi-type transaction sub-record amount displayed incorrectly, an update version has been released to correct it."
        }
    },
    {
        "id": 3,
        "type": "BUG",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/07/27",
        "datetime_end": "2022/07/28",
        "zh_TW": {
            "title": "多類別交易之子紀錄金額顯示有誤",
            "content": "已知「多類別交易紀錄」於查看子紀錄時，子紀錄之「顯示金額」為整筆交易的總額，而非各子紀錄的金額。此問題不影響各頁面資料之金額加總，將待更新後修復。"
        },
        "en_US": {
            "title": "The sub-record amount of the multi-type transaction is displayed incorrectly",
            "content": "It is known that when viewing sub-records in a \"multi-type transaction record\", the \"displayed amount\" of the sub-record is the total amount of the entire transaction, not the amount of each sub-record. This problem does not affect the total amount of data on each page and will be fixed after the update."
        }
    },
    {
        "id": 2,
        "type": "FIXED",
        "level": "HIGH",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/07/26",
        "datetime_end": "2022/07/28",
        "zh_TW": {
            "title": "[已修復] 關於1.3.1版資料格式轉換失敗",
            "content": "先前版本之「專案及預算」無法正確轉換資料至新格式之問題，已發布更新檔統一修正此問題。資料轉換失敗的使用者在開啟應用程式後、或還原Google雲端的備份資料時，會再自動執行轉換機制。很抱歉造成您的不便！"
        },
        "en_US": {
            "title": "[FIXED] About version 1.3.1 data format conversion failure",
            "content": "The previous version of \"Project & Budget\" could not convert data to the new format correctly. An update has been released to fix this problem. If the data conversion fails, the conversion process will be automatically executed after the user opens the application or restores the backup data in Google Cloud. Sorry for the inconvenience!"
        }
    },
    {
        "id": 1,
        "type": "BUG",
        "level": "HIGH",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/07/26",
        "datetime_end": "2022/07/28",
        "zh_TW": {
            "title": "關於1.3.1版資料格式轉換失敗",
            "content": "於2022/07/26已知部分使用者在更新完1.3.1版後之「專案及預算」於特定紀䤸值有機率出現錯誤導致無法正確轉換資料至新格式，稍晚將會發布更新檔統一修正此問題。存在手機上的資料在沒有解除安裝應用程式的情況下，皆不會消失，也請有問題的使用者暫時不要對資料進行異動。"
        },
        "en_US": {
            "title": "About version 1.3.1 data format conversion failure",
            "content": "On 2022/07/26, it is known that some users may have special cases in \"Project & Budget\" data after updating version 1.3.1, which may cause the data to be unable to be converted to the new format correctly. The updated files will be released later for unified corrections this problem. The data on the mobile phone will not disappear without uninstalling the app, and users who have problems should not change the data for the time being."
        }
    }
]