[
    {
        "id": 4,
        "type": "FIXED",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/07/27",
        "datetime_end": "2022/07/28",
        "zh_TW": {
            "title": "[已修復] 多類別交易之子紀錄金額顯示有誤",
            "content": "先前版本之多類別交易之子紀錄金額顯示有誤之情況，已發布更新檔進行修正。"
        },
        "en_US": {
            "title": "[FIXED] The sub-record amount of the multi-type transaction is displayed incorrectly",
            "content": "The previous version of the multi-type transaction sub-record amount displayed incorrectly, an update version has been released to correct it."
        }
    },
    {
        "id": 3,
        "type": "BUG",
        "level": "NORMAL",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/07/27",
        "datetime_end": "2022/07/28",
        "zh_TW": {
            "title": "多類別交易之子紀錄金額顯示有誤",
            "content": "已知「多類別交易紀錄」於查看子紀錄時，子紀錄之「顯示金額」為整筆交易的總額，而非各子紀錄的金額。此問題不影響各頁面資料之金額加總，將待更新後修復。"
        },
        "en_US": {
            "title": "The sub-record amount of the multi-type transaction is displayed incorrectly",
            "content": "It is known that when viewing sub-records in a \"multi-type transaction record\", the \"displayed amount\" of the sub-record is the total amount of the entire transaction, not the amount of each sub-record. This problem does not affect the total amount of data on each page and will be fixed after the update."
        }
    },
    {
        "id": 2,
        "type": "FIXED",
        "level": "MODERATE",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/07/26",
        "datetime_end": "2022/07/28",
        "zh_TW": {
            "title": "[已修復] 關於1.3.1版資料格式轉換失敗",
            "content": "先前版本之「專案及預算」無法正確轉換資料至新格式之問題，已發布更新檔統一修正此問題。資料轉換失敗的使用者在開啟應用程式後、或還原Google雲端的備份資料時，會再自動執行轉換機制。很抱歉造成您的不便！"
        },
        "en_US": {
            "title": "[FIXED] About version 1.3.1 data format conversion failure",
            "content": "The previous version of \"Project & Budget\" could not convert data to the new format correctly. An update has been released to fix this problem. If the data conversion fails, the conversion process will be automatically executed after the user opens the application or restores the backup data in Google Cloud. Sorry for the inconvenience!"
        }
    },
    {
        "id": 1,
        "type": "BUG",
        "level": "HIGH",
        "scopes": ["PROD", "DEV"],
        "datetime_start": "2022/07/26",
        "datetime_end": "2022/07/28",
        "zh_TW": {
            "title": "關於1.3.1版資料格式轉換失敗",
            "content": "於2022/07/26已知部分使用者在更新完1.3.1版後之「專案及預算」於特定紀䤸值有機率出現錯誤導致無法正確轉換資料至新格式，稍晚將會發布更新檔統一修正此問題。存在手機上的資料在沒有解除安裝應用程式的情況下，皆不會消失，也請有問題的使用者暫時不要對資料進行異動。"
        },
        "en_US": {
            "title": "About version 1.3.1 data format conversion failure",
            "content": "On 2022/07/26, it is known that some users may have special cases in \"Project & Budget\" data after updating version 1.3.1, which may cause the data to be unable to be converted to the new format correctly. The updated files will be released later for unified corrections this problem. The data on the mobile phone will not disappear without uninstalling the app, and users who have problems should not change the data for the time being."
        }
    }
]